import pandas as pd

data = {
    'Имя': ['Артур', 'Борис', 'Виола', 'Диана', 'Кирилл', 'Марта', 'Павел', 'Снежана', 'Эмилия', 'Юрий'],
    'Математика': [3, 4, 5, 4, 3, 5, 2, 4, 3, 5],
    'Физика': [4, 3, 5, 2, 4, 5, 4, 3, 4, 5],
    'Химия': [5, 4, 3, 5, 4, 3, 4, 5, 2, 4],
    'Биология': [5, 5, 4, 3, 5, 4, 3, 2, 4, 5],
    'Литература': [4, 5, 3, 4, 5, 2, 3, 5, 4, 3]
}

df = pd.DataFrame(data)

print("---> Первые пять строк DataFrame:")
print(df.head())

average_mark = df[['Математика', 'Физика', 'Химия', 'Биология', 'Литература']].mean()
print("\n---> Средняя оценка по каждому предмету:")
print(average_mark)

median_mark = df[['Математика', 'Физика', 'Химия', 'Биология', 'Литература']].median()
print("\n---> Медианная оценка по каждому предмету:")
print(median_mark)

Q1_math = df['Математика'].quantile(0.25)
Q3_math = df['Математика'].quantile(0.75)
print("\n---> Q1 и Q3 для оценок по математике:")
print(f"Q1 (1-ый квартиль): {Q1_math}")
print(f"Q3 (3-ий квартиль): {Q3_math}")

IQR = Q3_math - Q1_math
print("\n---> Межквартальный размах IQR для оценок по математике:")
print(f"{IQR}")

std_dev = df[['Математика', 'Физика', 'Химия', 'Биология', 'Литература']].std()
print("\n---> Стандартное отклонение по каждому предмету:")
print(std_dev)
